[ {
  "type" : "general",
  "jokes" : [ {
    "id" : 258,
    "text" : "What lies at the bottom of the ocean and twitches? A nervous wreck."
  }, {
    "id" : 180,
    "text" : "Why don't you find hippopotamuses hiding in trees? They're really good at it."
  }, {
    "id" : 339,
    "text" : "Why didn’t the skeleton cross the road? Because he had no guts."
  }, {
    "id" : 8,
    "text" : "How many lips does a flower have? Tulips"
  }, {
    "id" : 81,
    "text" : "Can February march? No, but April may."
  }, {
    "id" : 52,
    "text" : "How do you make holy water? You boil the hell out of it"
  }, {
    "id" : 101,
    "text" : "Did you know crocodiles could grow up to 15 feet? But most just have 4."
  }, {
    "id" : 195,
    "text" : "What do you call a cow on a trampoline? A milk shake!"
  }, {
    "id" : 198,
    "text" : "What do you call a dad that has fallen through the ice? A Popsicle."
  }, {
    "id" : 289,
    "text" : "Where do young cows eat lunch? In the calf-ateria."
  }, {
    "id" : 40,
    "text" : "I just watched a documentary about beavers. It was the best dam show I ever saw"
  }, {
    "id" : 317,
    "text" : "Why did the burglar hang his mugshot on the wall? To prove that he was framed!"
  }, {
    "id" : 294,
    "text" : "Where’s the bin? I haven’t been anywhere!"
  }, {
    "id" : 299,
    "text" : "Why are fish so smart? Because they live in schools!"
  }, {
    "id" : 428,
    "text" : "Why did the chicken cross the playground? To get to the other slide."
  }, {
    "id" : 400,
    "text" : "You see, mountains aren't just funny. They are hill areas."
  }, {
    "id" : 45,
    "text" : "Finally realized why my plant sits around doing nothing all day... He loves his pot."
  }, {
    "id" : 272,
    "text" : "What's the difference between a seal and a sea lion? An ion! "
  }, {
    "id" : 365,
    "text" : "Two guys walk into a bar . . . The first guy says \"Ouch!\" and the second says \"Yeah, I didn't see it either.\""
  }, {
    "id" : 293,
    "text" : "Where was the Declaration of Independence signed? At the bottom! "
  }, {
    "id" : 303,
    "text" : "Why are oranges the smartest fruit? Because they are made to concentrate. "
  }, {
    "id" : 310,
    "text" : "Why couldn't the kid see the pirate movie? Because it was rated arrr!"
  }, {
    "id" : 271,
    "text" : "What's the difference between a hippo and a zippo? One is really heavy, the other is a little lighter."
  }, {
    "id" : 187,
    "text" : "What do birds give out on Halloween? Tweets."
  }, {
    "id" : 286,
    "text" : "Where do rabbits go after they get married? On a bunny-moon."
  }, {
    "id" : 327,
    "text" : "Why did the kid cross the playground? To get to the other slide."
  }, {
    "id" : 359,
    "text" : "Why does Norway have barcodes on their battleships? So when they get back to port, they can Scandinavian."
  }, {
    "id" : 329,
    "text" : "Why did the man run around his bed? Because he was trying to catch up on his sleep!"
  }, {
    "id" : 7,
    "text" : "What do you call a singing Laptop? A Dell"
  }, {
    "id" : 75,
    "text" : "Never take advice from electrons. They are always negative."
  }, {
    "id" : 129,
    "text" : "How do you organize a space party? You planet."
  }, {
    "id" : 84,
    "text" : "Did you hear about the bread factory burning down? They say the business is toast."
  }, {
    "id" : 434,
    "text" : "Why did the cookie go to the doctor?  Because it was feeling crumbly."
  }, {
    "id" : 157,
    "text" : "What creature is smarter than a talking parrot? A spelling bee."
  }, {
    "id" : 321,
    "text" : "Why did the cookie cry? It was feeling crumby."
  }, {
    "id" : 142,
    "text" : "How many seconds are in a year? 12. January 2nd, February 2nd, March 2nd, April 2nd.... etc"
  }, {
    "id" : 49,
    "text" : "What do you call a factory that sells passable products? A satisfactory"
  }, {
    "id" : 398,
    "text" : "99.9% of the people are dumb! Fortunately I belong to the remaining 1%"
  }, {
    "id" : 377,
    "text" : "Why is seven bigger than nine? Because seven ate nine."
  }, {
    "id" : 280,
    "text" : "When do doctors get angry? When they run out of patients."
  }, {
    "id" : 203,
    "text" : "What do you call a fake noodle? An impasta."
  }, {
    "id" : 344,
    "text" : "Why do birds fly south for the winter? Because it's too far to walk."
  }, {
    "id" : 295,
    "text" : "Which side of the chicken has more feathers? The outside."
  }, {
    "id" : 389,
    "text" : "Why did the kid throw the watch out the window? So time would fly."
  }, {
    "id" : 150,
    "text" : "Want to hear a chimney joke? Got stacks of em! First one's on the house"
  }, {
    "id" : 277,
    "text" : "What’s Forest Gump’s Facebook password? 1forest1"
  }, {
    "id" : 64,
    "text" : "Well... That’s a deep subject."
  }, {
    "id" : 6,
    "text" : "How does a train eat? It goes chew, chew"
  }, {
    "id" : 109,
    "text" : "Have you ever heard of a music group called Cellophane? They mostly wrap."
  }, {
    "id" : 65,
    "text" : "Did you hear the story about the cheese that saved the world? It was legend dairy."
  }, {
    "id" : 178,
    "text" : "What did the ocean say to the beach? Thanks for all the sediment."
  }, {
    "id" : 351,
    "text" : "Why do scuba divers fall backwards into the water? Because if they fell forwards they’d still be in the boat."
  }, {
    "id" : 163,
    "text" : "What did one wall say to the other wall? I'll meet you at the corner!"
  }, {
    "id" : 94,
    "text" : "Did you hear about the scientist who was lab partners with a pot of boiling water? He had a very esteemed colleague."
  }, {
    "id" : 223,
    "text" : "What do you call corn that joins the army? Kernel."
  }, {
    "id" : 239,
    "text" : "What is a centipedes's favorite Beatle song? I want to hold your hand, hand, hand, hand..."
  }, {
    "id" : 37,
    "text" : "I'm reading a book about anti-gravity... It's impossible to put down"
  }, {
    "id" : 307,
    "text" : "Why can't you use \"Beef stew\"as a password? Because it's not stroganoff."
  }, {
    "id" : 115,
    "text" : "How come the stadium got hot after the game? Because all of the fans left."
  }, {
    "id" : 2,
    "text" : "How do you make a tissue dance? You put a little boogie on it."
  }, {
    "id" : 251,
    "text" : "What kind of bagel can fly? A plain bagel."
  }, {
    "id" : 206,
    "text" : "What do you call a fly without wings? A walk."
  }, {
    "id" : 189,
    "text" : "What do prisoners use to call each other? Cell phones."
  }, {
    "id" : 234,
    "text" : "What does a clock do when it's hungry? It goes back four seconds!"
  }, {
    "id" : 248,
    "text" : "What is the tallest building in the world? The library, it’s got the most stories!"
  }, {
    "id" : 354,
    "text" : "Why do wizards clean their teeth three times a day? To prevent bat breath!"
  }, {
    "id" : 155,
    "text" : "What biscuit does a short person like? Shortbread. "
  }, {
    "id" : 282,
    "text" : "When is a door not a door? When it's ajar."
  }, {
    "id" : 336,
    "text" : "Why did the worker get fired from the orange juice factory? Lack of concentration."
  }, {
    "id" : 21,
    "text" : "A termite walks into a bar and says... 'Where is the bar tended?'"
  }, {
    "id" : 265,
    "text" : "What's blue and not very heavy? Light blue."
  }, {
    "id" : 313,
    "text" : "Why did Sweden start painting barcodes on the sides of their battleships? So they could Scandinavian."
  }, {
    "id" : 403,
    "text" : "Due to complaints, Hawaii passed a law where you're not allowed to laugh above a certain decibel. You can only use a low ha."
  }, {
    "id" : 243,
    "text" : "What is red and smells like blue paint? Red paint!"
  }, {
    "id" : 238,
    "text" : "What has ears but cannot hear? A field of corn."
  }, {
    "id" : 249,
    "text" : "What is this movie about? It is about 2 hours long."
  }, {
    "id" : 290,
    "text" : "Where does batman go to the bathroom? The batroom."
  }, {
    "id" : 116,
    "text" : "How did Darth Vader know what Luke was getting for Christmas? He felt his presents."
  }, {
    "id" : 296,
    "text" : "Who did the wizard marry? His ghoul-friend"
  }, {
    "id" : 200,
    "text" : "what do you call a dog that can do magic tricks? a labracadabrador"
  }, {
    "id" : 154,
    "text" : "What are the strongest days of the week? Saturday and Sunday...the rest are weekdays."
  }, {
    "id" : 139,
    "text" : "How many hipsters does it take to change a lightbulb? Oh, it's a really obscure number. You've probably never heard of it."
  }, {
    "id" : 193,
    "text" : "What do you call a boomerang that won't come back? A stick."
  }, {
    "id" : 346,
    "text" : "Why do crabs never give to charity? Because they’re shellfish."
  }, {
    "id" : 394,
    "text" : "Did you hear about the crime in the parking garage? It was wrong on so many levels."
  }, {
    "id" : 138,
    "text" : "How many bones are in the human hand? A handful of them."
  }, {
    "id" : 212,
    "text" : "What do you call a pig that knows karate? A pork chop!"
  }, {
    "id" : 250,
    "text" : "What kind of award did the dentist receive? A little plaque."
  } ]
}, {
  "type" : "dad",
  "jokes" : [ {
    "id" : 384,
    "text" : "Why don't eggs tell jokes? Because they would crack each other up."
  } ]
}, {
  "type" : "knock-knock",
  "jokes" : [ {
    "id" : 11,
    "text" : "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless."
  } ]
}, {
  "type" : "programming",
  "jokes" : [ {
    "id" : 440,
    "text" : "Why don't programmers like nature? Too many bugs."
  }, {
    "id" : 58,
    "text" : "Lady: How do I spread love in this cruel world? Random Dude: [...💘]"
  }, {
    "id" : 441,
    "text" : "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level."
  }, {
    "id" : 435,
    "text" : "What do you call a computer mouse that swears a lot? A cursor!"
  }, {
    "id" : 418,
    "text" : "Why did the programmer always mix up Halloween and Christmas? Because Oct 31 equals Dec 25."
  }, {
    "id" : 371,
    "text" : "What’s the object-oriented way to become wealthy? Inheritance."
  }, {
    "id" : 382,
    "text" : "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31"
  }, {
    "id" : 16,
    "text" : "What's the object-oriented way to become wealthy? Inheritance"
  }, {
    "id" : 25,
    "text" : "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl"
  }, {
    "id" : 444,
    "text" : "Why did the developer go to therapy? They had too many unresolved issues."
  } ]
} ]
